name: "mistral7b"
backend: "python"
max_batch_size: 0

model_transaction_policy {
  decoupled: True
}

input [
  {
    name: "PROMPT"
    data_type: TYPE_STRING
    dims: [ 1 ]
  },
  {
    name: "STREAM"
    data_type: TYPE_BOOL
    dims: [ 1 ]
  },
  {
    name: "SAMPLING_PARAMETERS"
    data_type: TYPE_STRING
    dims: [ 1 ]
    optional: true
  }
]

output [
  {
    name: "TEXT"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
    gpus: [ 1 ]  # Explicitly assign to GPU 1
  }
]

parameters: {
  key: "model_name"
  value: { string_value: "mistralai/Mistral-7B-Instruct-v0.2" }
}
parameters: {
  key: "tensor_parallel_size"
  value: { string_value: "1" }
}
parameters: {
  key: "gpu_memory_utilization"
  value: { string_value: "0.8" }
}
parameters: {
  key: "max_model_len"
  value: { string_value: "4096" }
}
parameters: {
  key: "dtype"
  value: { string_value: "auto" }
}
parameters: {
  key: "enforce_eager"
  value: { string_value: "true" }
}
